In [2]:
%load_ext sql

In [3]:
%env DATABASE_URL=postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/food_claims_datacamp_cert

env: DATABASE_URL=postgresql://postgres:mMPR85ZV6psocMUPR98DDKWz@localhost/food_claims_datacamp_cert

In [4]:
%sql select * from claims limit 10

10 rows affected.

[('0000000-00.2010.0.00.0094', Decimal('2082'), 'R$50,000.00', Decimal('34297.47'), 'RECIFE', Decimal('2'), 'FALSE', None),
 ('0000000-00.2011.0.00.0086', Decimal('3591'), 'R$180,000.00', Decimal('56383.54'), 'SAO LUIS', Decimal('7'), 'FALSE', None),
 ('0000000-00.2012.0.00.0092', Decimal('2997'), 'R$70,000.00', Decimal('12366.76'), 'SAO LUIS', Decimal('3'), 'FALSE', 'vegetables'),
 ('0000000-00.2013.0.00.0096', Decimal('1143'), 'R$95,104.00', Decimal('29217.16'), 'FORTALEZA', Decimal('4'), 'FALSE', None),
 ('0000000-00.2014.0.00.0097', Decimal('117'), 'R$29,000.00', Decimal('12610.5'), 'FORTALEZA', Decimal('1'), 'FALSE', 'meat'),
 ('0000000-00.2014.0.00.0077', Decimal('578'), 'R$150,000.00', Decimal('23214.56'), 'FORTALEZA', Decimal('6'), 'FALSE', None),
 ('0000000-00.2014.0.00.0076', Decimal('378'), 'R$50,000.00', Decimal('25281.18'), 'NATAL', Decimal('2'), 'FALSE', 'meat'),
 ('0000000-00.2014.0.00.0043', Decimal('2354'), 'R$40,870.00', Decimal('24161.73'), 'FORTALEZA', Decimal('1'), 'FALSE', None),
 ('0000000-00.2014.0.00.0071', Decimal('2325'), 'R$70,000.00', Decimal('37464.39'), 'FORTALEZA', Decimal('3'), 'FALSE', None),
 ('0000000-00.2015.0.00.0000', Decimal('2058'), 'R$55,000.00', Decimal('9199.03'), 'RECIFE', Decimal('2'), 'FALSE', None)]

tras primer vistazo de la base de datos se identifico que el campo "claim_id" esta compuesto por el a√±o del claim en conjunto de lo que pareciera ser un consecutivo. **Se procede a manipular el mismo**.

In [9]:
##verificar que no hayan duplicados del campo claim_id 
%sql select claim_id, count(*) from claims group by 1 having count(*) >1;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
0 rows affected.

[]

In [11]:
##debido a que no se especifica como fue el metodo de data entry del dataset. Se corre query para descartar errores de espacios en el campo de interes claim_id

%sql update claims set claim_id=trim(claim_id);

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]

In [13]:
## extraer el dato de interes del string "claim_id"

%sql select *, split_part(claim_id,'.',5) as claim_number, split_part(claim_id,'.',2) as year from claims limit 5;

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
5 rows affected.

[('0000000-00.2016.0.00.0019', Decimal('1614'), 'R$40,000.00', Decimal('19311.26'), 'SAO LUIS', Decimal('1'), 'FALSE', None, '0019', '2016'),
 ('0000000-00.2016.0.00.0027', Decimal('1728'), 'R$48,872.00', Decimal('36432.29'), 'SAO LUIS', Decimal('2'), 'FALSE', None, '0027', '2016'),
 ('0000000-00.2016.0.00.0090', Decimal('1696'), 'R$40,000.00', Decimal('23605.38'), 'SAO LUIS', Decimal('1'), 'FALSE', None, '0090', '2016'),
 ('0000000-00.2016.0.00.0025', Decimal('1573'), 'R$200,000.00', Decimal('150832.19'), 'RECIFE', Decimal('8'), 'FALSE', 'vegetables', '0025', '2016'),
 ('0000000-00.2017.0.00.0029', Decimal('1126'), 'R$88,282.00', Decimal('50867.69'), 'SAO LUIS', Decimal('3'), 'FALSE', None, '0029', '2017')]

Se suman dos columnas a la base de datos, year y claim_number ambos extraidos de la columna "claim_id"

In [16]:
%sql ALTER TABLE claims ADD COLUMN year smallint, ADD COLUMN claim_number numeric

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
Done.

[]

In [19]:
%sql update claims set year=split_part(claim_id,'.',2)::numeric

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]

In [20]:
%sql update claims set claim_number=split_part(claim_id,'.',5)::numeric

 * postgresql://postgres:***@localhost/food_claims_datacamp_cert
98 rows affected.

[]